{
  "backend/main.mo": "Minimal backend actor with no logic needed for mainnet deployment.",
  "feature_evidence.json": "Feature evidence listing two navigation‑related features with affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of numerous frontend files including navigation, layout, content, theming, and routing.",
  "frontend/DEPLOYMENT.md": "Checklist outlining steps to verify and deploy the frontend asset canister for mainnet go-live.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH brand color variables and dark mode mappings.",
  "frontend/index.html": "Root HTML entry file loading fonts, favicon, metadata, and mounting the React app.",
  "frontend/RELEASE_NOTES.md": "Release notes detailing the mainnet deployment, included features, routes, assets, and technical fixes.",
  "frontend/src/App.tsx": "Wraps the router with ThemeProvider to enable system-based dark/light mode.",
  "frontend/src/components/brand/BrandButton.tsx": "Brand-styled wrapper around the shadcn Button adding primary, secondary, and accent variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Logo component with fallback text rendering if the image fails to load.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renders content sections and blocks including headings, lists, emphasis, and link-list grids.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info and navigation links for solutions, industries, and company sections.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements a responsive header with navigation, dropdown menus, a solutions mega menu, and mobile menu support.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout wrapping header, footer, and routed content with the solutions scroll-sync provider.",
  "frontend/src/components/layout/SolutionsMegaMenu.tsx": "Displays a two-column mega menu showing solution categories and preview services with hover-based updates.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the homepage hero with background image, headline, and CTA buttons linking to contact and solutions.",
  "frontend/src/content/contentSourceLinks.ts": "Lists Google Drive URLs used as source documents for manually maintained page content.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript interfaces for structured page content blocks, sections, and link items.",
  "frontend/src/content/pages.ts": "Contains structured page content definitions for solutions and subpages, using service lookups to populate links.",
  "frontend/src/content/solutionServicePages.ts": "Defines detailed PageContent objects for each solution service, including IDs, titles, and structured content sections.",
  "frontend/src/content/solutionServices.ts": "Provides a registry of all solution services with their page IDs, titles, routes, and parent categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using react-query and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useDropdownHoverRegion.ts": "Implements hover-state tracking across trigger and dropdown panel regions using pointer tracking and interval checks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, and identity loading via AuthClient with context.",
  "frontend/src/hooks/usePageTitle.ts": "Updates document title based on the given page title and appends brand name when appropriate.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend queries with no current functionality.",
  "frontend/src/hooks/useSolutionsActiveCategoryInView.ts": "Tracks visibility of solution category sections via IntersectionObserver and determines the active category using hysteresis.",
  "frontend/src/index.css": "Defines Tailwind layers plus extensive light and dark theme CSS variables and base element styling.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, importing global styles.",
  "frontend/src/pages/ContentPage.tsx": "Renders dynamic content pages with theme variables, banner handling, and fallback behavior.",
  "frontend/src/pages/CustomDomainPage.tsx": "Displays instructions for configuring a custom domain with DNS steps and copy-to-clipboard hostname.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section and overview cards for AV solution categories and industries.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page showing an illustration and a button linking back home.",
  "frontend/src/pages/SolutionsLandingPage.tsx": "Landing page listing solution categories with scroll-sync tracking and optional hero banner.",
  "frontend/src/router/router.tsx": "Defines the site's full routing structure using TanStack Router, including solutions, industries, and dynamic service routes.",
  "frontend/src/site/brand.ts": "Exports brand constants such as name, domain, logo, and contact info.",
  "frontend/src/site/industryThemes.ts": "Provides color theme definitions for industry pages and a helper to fetch a theme by page ID.",
  "frontend/src/site/navigation.ts": "Defines the navigation menu structure with nested items and includes a helper to flatten all routes.",
  "frontend/src/site/pageBannerResolver.ts": "Resolves banner images for pages using naming conventions with fallback to predefined mappings.",
  "frontend/src/site/pageBanners.ts": "Maps page IDs to their specific banner images and alt text.",
  "frontend/src/site/pageThemes.ts": "Determines a page's theme based on whether it is a solutions or industry page.",
  "frontend/src/solutions/solutionsScrollSyncContext.tsx": "Provides React context to track and reset the active solutions category based on route changes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, plugins, colors, fonts, animations, and container settings.",
  "project_state.json": "Describes project metadata and feature requests related to improving header navigation hover dropdown behavior."
}