{
  "backend/main.mo": "Minimal Motoko backend actor with no logic; no changes needed for mainnet.",
  "feature_evidence.json": "Feature evidence report describing navigation reordering referencing frontend navigation file.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short human-written summaries.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment checklist outlining build and verification steps for the frontend canister.",
  "frontend/index.css": "Global Tailwind CSS variables and theming definitions for light/dark modes and brand palette.",
  "frontend/index.html": "Base HTML template loading fonts, favicon, metadata, and mounting the React app.",
  "frontend/RELEASE_NOTES.md": "Release notes for v1.0.0 detailing deployed features, routing, configuration, and smoke tests.",
  "frontend/src/App.tsx": "Root App component applying ThemeProvider and TanStack Router.",
  "frontend/src/components/brand/BrandButton.tsx": "Branded wrapper around shadcn Button providing primary, secondary, and accent variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Brand logo component with image fallback to text when logo loading fails.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renders content sections with support for headings, lists, emphasis blocks, and link-list grids.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer layout showing brand logo and navigation links derived from navigationConfig.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the main site header with navigation, dropdowns, mobile menu handling, and a solutions mega menu tied to hover and scroll-sync state.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the app layout with header, footer, and scroll-sync provider, rendering routed content in the main area.",
  "frontend/src/components/layout/SolutionsMegaMenu.tsx": "Displays a two-column solutions mega menu with category previewing and lists services based on hover or active category.",
  "frontend/src/components/sections/HeroSection.tsx": "Shows the homepage hero with background image, headline, description, and primary navigation buttons.",
  "frontend/src/content/contentSourceLinks.ts": "Maps page and service identifiers to their source Google Docs URLs for manual content reference.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript interfaces for structured page content including blocks, sections, and link items.",
  "frontend/src/content/pages.ts": "Provides page content definitions for solutions and category subpages using structured blocks and generated service links.",
  "frontend/src/content/solutionServicePages.ts": "Contains PageContent objects for individual solution service pages with overview, features, and benefits sections.",
  "frontend/src/content/solutionServices.ts": "Defines the list of solution service definitions mapping pageIds to titles, routes, and categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useDropdownHoverRegion.ts": "Tracks pointer position across trigger and dropdown panel to keep dropdown open until the pointer leaves both regions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/usePageTitle.ts": "Updates the document title with brand-aware formatting and restores the previous title on unmount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend queries with no current functionality.",
  "frontend/src/hooks/useSolutionsActiveCategoryInView.ts": "Observes category sections and determines the active one based on visibility with hysteresis to avoid flicker.",
  "frontend/src/index.css": "Configures Tailwind base styles and extensive CSS variables for light and dark theme color systems.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/ContentPage.tsx": "Renders generic content pages with themed styling, page titles, and optional banner handling with fallback logic.",
  "frontend/src/pages/CustomDomainPage.tsx": "Provides instructions for configuring a custom domain, including DNS setup steps and hostname copy functionality.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section and a grid of AV solution categories linking to detailed pages.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 error page with an illustration and a button linking back to the homepage.",
  "frontend/src/pages/SolutionsLandingPage.tsx": "Lists all solution categories with a hero banner, scroll-synced sections, and links to category and service pages.",
  "frontend/src/router/router.tsx": "Defines the application's routing structure, mapping root, solution, industry, and dynamic service routes to their components.",
  "frontend/src/site/brand.ts": "Exports brand metadata including name, domain, logo, and contact information for consistent site-wide use.",
  "frontend/src/site/industryThemes.ts": "Contains theme color mappings for industry pages and a helper to retrieve an industry's theme by page ID.",
  "frontend/src/site/navigation.ts": "Defines navigation item structure and exports full site navigation config plus a helper to flatten all routes.",
  "frontend/src/site/pageBannerResolver.ts": "Resolves page banner images by filename convention with fallback to a predefined banner map.",
  "frontend/src/site/pageBanners.ts": "Provides a mapping of page IDs to their banner image paths and alt text.",
  "frontend/src/site/pageThemes.ts": "Returns theme settings for solution and industry pages based on predefined theme rules.",
  "frontend/src/solutions/solutionsScrollSyncContext.tsx": "Implements a React context to track the active solutions category and reset it when leaving the solutions page.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and plugin settings.",
  "project_state.json": "Stores project metadata, known issues, and feature requests for navigation reordering."
}