{
  "backend/main.mo": "Minimal Motoko actor with no backend logic needed for mainnet deployment.",
  "feature_evidence.json": "Feature evidence listing hover-based desktop header dropdown updates and single-dropdown behavior with associated files and metadata.",
  "frontend-file-summaries.txt": "Compiled summaries of all major frontend files covering navigation, routing, layout, content rendering, styling, and hooks.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment checklist outlining frontend asset canister build and verification steps.",
  "frontend/index.css": "Global Tailwind CSS layers defining light/dark theme variables and base styling tokens.",
  "frontend/index.html": "HTML entry point loading fonts, metadata, favicon, and mounting the React app.",
  "frontend/RELEASE_NOTES.md": "Release notes for initial mainnet deployment detailing features, routing, assets, content, configuration, and testing guidance.",
  "frontend/src/App.tsx": "Root component applying ThemeProvider and rendering the TanStack Router.",
  "frontend/src/components/brand/BrandButton.tsx": "Wrapper around shadcn Button adding brand-specific primary, secondary, and accent variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Brand logo component with image fallback to text when loading fails.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renders structured content blocks including headings, paragraphs, lists, emphasis, and link-list grids.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info and navigation sections sourced from navigationConfig.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements the main header with navigation, dropdowns, mobile menu, and solutions mega menu handling.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the overall page layout including header, footer, and routing outlet wrapped in the scroll sync provider.",
  "frontend/src/components/layout/SolutionsMegaMenu.tsx": "Displays a two‑column mega menu for solution categories with hover‑based service previews.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the homepage hero section with background image, headline, and calls to action.",
  "frontend/src/content/contentSourceLinks.ts": "Lists Google Drive source document URLs for manual content reference per page and service.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript interfaces for structured page content blocks, sections, and pages.",
  "frontend/src/content/pages.ts": "Contains static page content definitions for solutions pages, including sections and service links.",
  "frontend/src/content/solutionServicePages.ts": "Defines PageContent objects for individual solution service pages, including sections and text for each service.",
  "frontend/src/content/solutionServices.ts": "Lists all service definitions with page IDs, titles, routes, and parent solution categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity state and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useDropdownHoverRegion.ts": "Tracks pointer position to determine whether a dropdown’s trigger or panel should remain open and signals when it should close.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading, login, logout, and identity state management using Dfinity AuthClient.",
  "frontend/src/hooks/usePageTitle.ts": "Sets the document title based on the page title and brand name, restoring the previous title on unmount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend query hooks.",
  "frontend/src/hooks/useSolutionsActiveCategoryInView.ts": "Observes category sections to determine which is most visible and triggers updates with hysteresis to avoid flicker.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables plus base and utility styles.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and mounts the root component.",
  "frontend/src/pages/ContentPage.tsx": "Renders dynamic content pages with optional themed styling and banner handling with image fallback logic.",
  "frontend/src/pages/CustomDomainPage.tsx": "Displays instructions for configuring a custom domain, including DNS steps and a copyable hostname.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing hero section and grids of AV solutions and industries served.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with illustration, message, and button linking back home.",
  "frontend/src/pages/SolutionsLandingPage.tsx": "Landing page listing solution categories with banner, scroll-synced sections, and links to service pages.",
  "frontend/src/router/router.tsx": "Defines the application's route structure using TanStack Router, including static solution and industry routes plus dynamic service routes.",
  "frontend/src/site/brand.ts": "Exports brand metadata such as name, domain, logo, and contact details.",
  "frontend/src/site/industryThemes.ts": "Defines per-industry color themes and provides a helper to fetch a theme by page ID.",
  "frontend/src/site/navigation.ts": "Defines the site's navigation tree and provides a utility to flatten it into a list of routes.",
  "frontend/src/site/pageBannerResolver.ts": "Resolves banner images using filename conventions with fallback to a predefined banner map.",
  "frontend/src/site/pageBanners.ts": "Maps page IDs to specific banner image paths and alt text for hero sections.",
  "frontend/src/site/pageThemes.ts": "Returns page theme settings by identifying whether a page belongs to solutions or industries.",
  "frontend/src/solutions/solutionsScrollSyncContext.tsx": "Provides React context for tracking the active solutions category and resets it when navigating away.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Describes the project state including features, requests, metadata, and versioning."
}