{
  "backend/main.mo": "Minimal Motoko actor with no functions defined.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions providing light/dark themes and design tokens.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, fonts, and loading the main script.",
  "frontend/src/App.tsx": "Wraps the router in a ThemeProvider to control light/dark mode and render the app.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders the brand logo with a fallback text mark if the image fails to load.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renders structured content blocks including headings, paragraphs, lists, and emphasis.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying brand info, navigation shortcuts, and responsive link sections.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with brand logo, desktop dropdown navigation, and mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper providing header, footer, and main content outlet.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the homepage hero section with background image, headline, description, and CTA buttons.",
  "frontend/src/content/contentSourceLinks.ts": "Provides a mapping of page IDs to their source Google Docs URLs and helper functions to retrieve them.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript types for content blocks, sections, and page content structures.",
  "frontend/src/content/pages.ts": "Stores static page content definitions, including sections, text blocks, and lists for various solution pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook for loading, logging in, and clearing user identities.",
  "frontend/src/hooks/usePageTitle.ts": "Sets the document title based on the page title and app brand, restoring the previous title on unmount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend query hooks.",
  "frontend/src/index.css": "Defines global Tailwind base styles and CSS variables for light/dark themes and industry-specific theming.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with query and identity providers before rendering.",
  "frontend/src/pages/ContentPage.tsx": "Renders a dynamic content page with optional industry theming, banner image, and section-based content rendering.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section and a grid of AV solution cards, setting the page title from brand metadata.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 not found page with an illustration and a button linking back home.",
  "frontend/src/router/router.tsx": "Defines all application routes using TanStack Router, mapping paths to ContentPage or specific page components.",
  "frontend/src/site/brand.ts": "Exports brand constants including name, domain, logo info, and contact details.",
  "frontend/src/site/industryThemes.ts": "Provides theme color configurations per industry and a helper to fetch a theme by page ID.",
  "frontend/src/site/navigation.ts": "Defines the site's navigation structure with nested items and a utility to flatten all routes.",
  "frontend/src/site/pageBanners.ts": "Maps page IDs to banner images and alt text for hero sections across the site.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, layout, animations, and loading core plugins.",
  "project_state.json": "Defines project metadata, theming requirements, logo fallback needs, and lists existing and requested features for industry‑specific color schemes and placeholder logo handling."
}