{
  "backend/main.mo": "Empty backend actor; no backend logic needed for mainnet deployment.",
  "feature_evidence.json": "Feature evidence report mapping two solution‑related features to their source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including routing, layout, content system, and styling.",
  "frontend/DEPLOYMENT.md": "Checklist document outlining steps to verify and deploy the frontend asset canister to the Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind CSS file defining brand color tokens, theme variables, and base light/dark mode styles.",
  "frontend/index.html": "HTML entry point loading fonts, favicon, metadata, and bootstrapping the React application.",
  "frontend/RELEASE_NOTES.md": "Release notes detailing the v1.0.0 mainnet deployment, included features, routes, assets, and smoke test requirements.",
  "frontend/src/App.tsx": "Main React App component providing the router and theme provider for the entire frontend.",
  "frontend/src/components/brand/BrandButton.tsx": "Shadcn Button wrapper providing brand‑specific primary, secondary, and accent variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Brand logo component that renders the primary logo with a text fallback on load error.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renders structured content sections with support for headings, text, lists, emphasis, and link‑list blocks.",
  "frontend/src/components/layout/SiteFooter.tsx": "Site footer rendering brand info and navigation links for Solutions, Industries, and Company sections.",
  "frontend/src/components/layout/SiteHeader.tsx": "Navigation header with active state logic, solutions dropdown, and mobile menu support.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level page layout wrapping header, footer, and content with scroll-sync provider.",
  "frontend/src/components/sections/HeroSection.tsx": "Homepage hero section with background image, headline, and CTA buttons.",
  "frontend/src/content/contentSourceLinks.ts": "Maps page IDs to canonical Google Drive source documents for manual content reference.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript interfaces for structured page content blocks and sections.",
  "frontend/src/content/pages.ts": "Registry of page content definitions for solutions and subpages using structured blocks.",
  "frontend/src/content/solutionServicePages.ts": "Content definitions for individual solution service pages with sections and feature lists.",
  "frontend/src/content/solutionServices.ts": "Master registry mapping solution services to their metadata, routes, and parent categories.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and stored identity restoration.",
  "frontend/src/hooks/usePageTitle.ts": "Updates the document title based on the given page title and brand name, restoring the previous title on unmount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend query hooks with no current functionality.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive light/dark theme color variables for the site's design system.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ContentPage.tsx": "Renders dynamic content pages with themed styling, banner handling, and fallback behavior for missing content.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section and summaries of solution categories using styled cards and navigation links.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a branded 404 page with an illustration and a button linking back to the homepage.",
  "frontend/src/pages/SolutionsLandingPage.tsx": "Displays the solutions landing page with a hero banner and scroll-synced category sections populated from navigation data.",
  "frontend/src/router/router.tsx": "Defines the app's routing structure, including root layout, solution and industry pages, and dynamic service routes.",
  "frontend/src/site/brand.ts": "Provides brand constants including name, domain, logo path, and contact info.",
  "frontend/src/site/industryThemes.ts": "Defines color themes for industry pages and provides a lookup function by page ID.",
  "frontend/src/site/navigation.ts": "Defines the site's navigation tree and provides a helper to flatten all routes.",
  "frontend/src/site/pageBannerResolver.ts": "Resolves banner images using filename conventions with fallback to a predefined mapping.",
  "frontend/src/site/pageBanners.ts": "Maps page IDs to their banner images and alt text for solutions, industries, about, and contact pages.",
  "frontend/src/site/pageThemes.ts": "Provides theme resolution for pages based on solutions or industry-specific themes.",
  "frontend/src/solutions/solutionsScrollSyncContext.tsx": "Implements context for tracking the active solutions category and resetting it when leaving the page.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, animations, and plugin settings.",
  "project_state.json": "Stores project metadata, features, and pending requests related to syncing the solutions dropdown with scroll behavior."
}