{
  "backend/main.mo": "Empty Motoko actor; no backend logic or changes required for mainnet deployment.",
  "feature_evidence.json": "Defines feature evidence entries linking features to frontend files and components for Home page UI updates.",
  "frontend-file-summaries.txt": "Lists concise descriptions of all key frontend files and their roles in the site structure and features.",
  "frontend/DEPLOYMENT.md": "Checklist outlining frontend build and deployment steps for Internet Computer mainnet.",
  "frontend/index.css": "Global Tailwind-based styles defining brand color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML entry point loading fonts, metadata, favicon, and mounting the React application.",
  "frontend/RELEASE_NOTES.md": "Mainnet release notes detailing features, routes, assets, configuration changes, and test checklists.",
  "frontend/src/App.tsx": "Wraps the router in ThemeProvider to enable routing and system-based theming.",
  "frontend/src/components/brand/BrandButton.tsx": "Brand-styled wrapper around Button supporting primary, secondary, and accent variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders the brand logo with fallback to text if the image fails to load.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renders content sections and blocks including headings, paragraphs, lists, emphasis, and link-list grids.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the footer with brand info and navigation links for solutions, industries, and company sections.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements the site header with navigation, dropdowns, mobile menu, and solutions mega menu logic.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main layout combining header, routed content, footer, and scroll-sync provider.",
  "frontend/src/components/layout/SolutionsMegaMenu.tsx": "Displays a two-column mega menu showing solution categories and previewing related services on hover.",
  "frontend/src/components/sections/HeroSection.tsx": "Renders the homepage hero banner with branding, messaging, and call‑to‑action buttons.",
  "frontend/src/content/contentSourceLinks.ts": "Lists Google Drive source document URLs for manually maintained page content.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript interfaces for structured page content blocks, sections, and pages.",
  "frontend/src/content/pages.ts": "Provides structured content definitions for all site pages, including solutions and services.",
  "frontend/src/content/solutionServicePages.ts": "Defines detailed PageContent objects for solution service pages, including sections, text blocks, and feature lists.",
  "frontend/src/content/solutionServices.ts": "Provides a registry of service definitions mapping pageIds to titles, routes, and parent categories.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useDropdownHoverRegion.ts": "Tracks pointer position across trigger and dropdown panel to control hover-based opening and closing.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, identity loading, and auth client setup.",
  "frontend/src/hooks/usePageTitle.ts": "Sets the document title using the page title and brand name, restoring the previous title on unmount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module for future backend query hooks.",
  "frontend/src/hooks/useSolutionsActiveCategoryInView.ts": "Observes category sections with IntersectionObserver to report the most visible category using hysteresis.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables plus base and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global CSS.",
  "frontend/src/pages/ContentPage.tsx": "Renders dynamic content pages with themed styling, banner resolution, and fallback handling.",
  "frontend/src/pages/CustomDomainPage.tsx": "Displays instructions for setting up a custom domain with DNS guidance and a copyable hostname.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section and multiple content sections describing expertise and services.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 page with an illustration and a button linking back home.",
  "frontend/src/pages/SolutionsLandingPage.tsx": "Displays a solutions overview with a hero banner and scroll-synced category sections linking to service pages.",
  "frontend/src/router/router.tsx": "Defines the application's route tree using TanStack Router, including solutions, industries, and dynamic service routes.",
  "frontend/src/site/brand.ts": "Provides brand metadata such as name, domain, logo path, and contact details.",
  "frontend/src/site/industryThemes.ts": "Defines color themes for each industry page and exposes a helper to retrieve them by page ID.",
  "frontend/src/site/navigation.ts": "Defines the site's navigation structure with nested menu items and includes a helper to flatten all routes.",
  "frontend/src/site/pageBannerResolver.ts": "Resolves banner images for pages using filename conventions with fallback to a predefined banner map.",
  "frontend/src/site/pageBanners.ts": "Maps page IDs to their corresponding banner image paths and alt text.",
  "frontend/src/site/pageThemes.ts": "Computes theme settings for pages based on whether they're solution or industry pages.",
  "frontend/src/solutions/solutionsScrollSyncContext.tsx": "Provides React context to track and reset the active solutions category based on navigation.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, plugins, colors, fonts, and animations for the project.",
  "project_state.json": "Defines project state for organizing website pages into structured sections without altering text and lists existing and new feature requests related to Home page implementation."
}