{
  "backend/main.mo": "Minimal Motoko actor with no backend logic required for mainnet deployment.",
  "feature_evidence.json": "Feature evidence file documenting navigation updates, content updates, and related components and test IDs.",
  "frontend-file-summaries.txt": "List of autogenerated summaries describing key frontend files and their responsibilities.",
  "frontend/DEPLOYMENT.md": "Checklist covering frontend asset canister build and verification steps for mainnet deployment.",
  "frontend/index.css": "Global Tailwind-based theme definitions including light/dark variables and base styling rules.",
  "frontend/index.html": "HTML entry file loading fonts, metadata, favicon, and bootstrapping the React app.",
  "frontend/RELEASE_NOTES.md": "Release notes detailing the v1.0.0 mainnet deployment, features, routes, and configuration changes.",
  "frontend/src/App.tsx": "Root React component providing theme support and TanStack router integration.",
  "frontend/src/components/brand/BrandButton.tsx": "Brand-styled button wrapper offering primary, secondary, and accent variants.",
  "frontend/src/components/brand/BrandLogo.tsx": "Logo component rendering the brand image with fallback to text when loading fails.",
  "frontend/src/components/content/ContentRenderer.tsx": "Renderer for structured content blocks including headings, lists, emphasis blocks, and link lists.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info and navigation sections for solutions, industries, and company links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements the main header with navigation, dropdown logic, mobile menu, and solutions mega menu integration.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the app layout with header, footer, and scroll-sync provider around routed content.",
  "frontend/src/components/layout/SolutionsMegaMenu.tsx": "Displays a two-column mega menu for solutions with category previews and dynamic service lists.",
  "frontend/src/components/sections/HeroSection.tsx": "Defines the homepage hero section with background image, headline, and CTA buttons.",
  "frontend/src/content/contentSourceLinks.ts": "Stores developer reference links to Google Docs containing manual content sources for pages and services.",
  "frontend/src/content/contentTypes.ts": "Defines TypeScript interfaces for structured page content, blocks, sections, and link items.",
  "frontend/src/content/pages.ts": "Registers structured page content for solutions and categories, including text blocks and service link lists.",
  "frontend/src/content/solutionServicePages.ts": "Defines detailed PageContent objects for solution service pages, including titles, sections, and structured text blocks.",
  "frontend/src/content/solutionServices.ts": "Provides a registry of all solution service definitions with pageIds, titles, routes, and category associations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s identity, refetching related queries when identity changes.",
  "frontend/src/hooks/useDropdownHoverRegion.ts": "Tracks pointer position to determine if a dropdown’s trigger or panel is hovered, triggering close when outside the region.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and logic for managing Internet Identity login, stored identity state, and auth client setup.",
  "frontend/src/hooks/usePageTitle.ts": "Updates the document title with brand-aware formatting and restores the previous title on unmount.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module reserved for future backend query utilities.",
  "frontend/src/hooks/useSolutionsActiveCategoryInView.ts": "Observes solution category sections and determines the active one based on intersection ratios with hysteresis to reduce flicker.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme CSS variables for colors, borders, and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ContentPage.tsx": "Renders dynamic content pages with themed styling and banner handling, including fallback logic on image errors.",
  "frontend/src/pages/CustomDomainPage.tsx": "Provides instructions and UI for setting up a custom domain, including DNS details and copy-to-clipboard support.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing hero content and a grid of AV solution categories with links to detailed pages.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with an illustration and a button to return home.",
  "frontend/src/pages/SolutionsLandingPage.tsx": "Landing page for all solution categories with hero banner, scroll-synced sections, and links to services.",
  "frontend/src/router/router.tsx": "Defines the full TanStack Router config, including root layout, solutions and industry pages, and dynamic service routes.",
  "frontend/src/site/brand.ts": "Exports brand constants like name, domain, logo, and contact info for consistent site-wide use.",
  "frontend/src/site/industryThemes.ts": "Defines color themes for industry pages and provides a helper to retrieve a theme by page ID.",
  "frontend/src/site/navigation.ts": "Defines the site's navigation structure and a helper that flattens nested navigation items into a full route list.",
  "frontend/src/site/pageBannerResolver.ts": "Resolves banner images for pages using filename conventions with fallback to predefined mappings.",
  "frontend/src/site/pageBanners.ts": "Maps page IDs to their banner image paths and alt text for hero images across solutions and industries.",
  "frontend/src/site/pageThemes.ts": "Provides theme selection logic for solutions and industry pages based on predefined color schemes.",
  "frontend/src/solutions/solutionsScrollSyncContext.tsx": "Implements React context to track and reset the active solutions category for scroll-sync behavior.",
  "frontend/tailwind.config.js": "Configures TailwindCSS, extending colors, fonts, animations, and layout settings for the project.",
  "project_state.json": "Defines project state for updating a website’s industry navigation and replacing content for ten industry pages. Includes schema info, architectural notes, and a list of existing features to implement or maintain."
}