{
  "kind": "build_request",
  "title": "Sync 'Our Solutions' dropdown with active solution category while scrolling",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the /solutions landing page content so that it contains 6 scrollable, clearly separated sections (one per solution category), and each category section renders a list/grid of its respective solution services as links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "nice now also on \"Our Solutions\" drop down menu 6 solution catagories appear let it show respective solutions when we scroll to specific solution category"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /solutions shows 6 distinct category sections matching the existing 6 solution categories in the navigation.",
        "Each category section includes a link-list (or equivalent grid) of the services for that category, using the existing solutionServices registry as the source of truth.",
        "Each category section has a stable DOM anchor/id so it can be observed/highlighted while scrolling."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement scroll-sync behavior so that when a user scrolls within /solutions and a specific solution category section becomes active (in viewport), the SiteHeader 'Our Solutions' dropdown updates to show/highlight the respective solutions for that active category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "let it show respective solutions when we scroll to specific solution category"
        ]
      },
      "acceptanceCriteria": [
        "On /solutions, as the user scrolls through the 6 category sections, the header 'Our Solutions' dropdown visibly reflects the currently active category (e.g., highlighted category item).",
        "On /solutions, the dropdown also shows the service links for the currently active category (using the same routes already defined for service pages).",
        "On pages other than /solutions, the 'Our Solutions' dropdown remains in its normal/default state (no scroll-sync required).",
        "The implementation does not require any backend changes and does not break existing navigation links/routes."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend remains single-actor; no backend changes are required for this feature."
  ],
  "nonGoals": [
    "Do not add new solution categories beyond the existing six.",
    "Do not implement real-time features (e.g., WebSockets) or any backend-driven navigation state.",
    "Do not change the existing service page routes/URLs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}