{
  "kind": "build_request",
  "title": "Refine header dropdown hover behavior (instant close, auto-switch, no flicker)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the desktop header navigation dropdown interaction so dropdowns open on hover and close immediately when the pointer leaves BOTH the top-level menu item area and the dropdown panel area (no click required). The hover logic must work reliably even though the dropdown panel is rendered outside the trigger’s DOM subtree (portal), and must avoid flicker when moving the pointer between the trigger and the dropdown panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "In the header navigation, when I hover over a menu item, its dropdown menu should appear.\n\nThe dropdown should disappear immediately when the mouse pointer moves outside the dropdown area and the main menu item area.\n\nIf I move the mouse to another header menu item, the previous dropdown should automatically disappear, and the new dropdown should appear.\n\nThe dropdown behavior should be smooth and should not flicker.\n\nUse hover-based behavior (no click required)."
        ]
      },
      "acceptanceCriteria": [
        "Hovering a top-level header item that has children opens its dropdown without requiring a click.",
        "When the pointer leaves the combined hover region (trigger + dropdown panel), the dropdown closes immediately (no intentional delay).",
        "Moving the pointer from the trigger to the dropdown panel does not cause the dropdown to close or flicker.",
        "Moving the pointer from one top-level header item to another automatically closes the previously open dropdown and opens the newly hovered item’s dropdown.",
        "The behavior applies consistently to the \"Our Solutions\" mega menu dropdown and other dropdowns (e.g., About Us, Industries We Serve)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove/replace the current timeout-based close behavior in the header dropdown implementation and ensure only one dropdown can be open at a time, with stable state transitions during rapid pointer movement across header items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "The dropdown should disappear immediately when the mouse pointer moves outside the dropdown area and the main menu item area.",
          "The dropdown behavior should be smooth and should not flicker.",
          "If I move the mouse to another header menu item, the previous dropdown should automatically disappear, and the new dropdown should appear."
        ]
      },
      "acceptanceCriteria": [
        "The header dropdown system does not rely on a close delay to prevent flicker; instead, it uses robust hover-region detection so closing is immediate when outside both trigger and panel.",
        "Rapidly moving the pointer across multiple top-level items does not leave multiple dropdowns open, and does not cause visible flashing/flicker of the dropdown panel.",
        "No regressions to navigation link routing: clicking dropdown items still navigates to the correct route."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (these are read-only UI component sources).",
    "Keep changes scoped to the existing header/dropdown behavior; do not introduce click-to-open as a requirement for normal operation."
  ],
  "nonGoals": [
    "Implementing new navigation items, changing navigation labels, or reordering the menu.",
    "Adding backend support or storing navigation state on the backend.",
    "Adding third-party menu libraries or non-hover interaction paradigms (e.g., click-only dropdowns)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text in the build request."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}