{
  "kind": "build_request",
  "title": "Refine desktop header dropdown hover behavior (no flicker, auto-switch)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the desktop header navigation so each top-level menu item with children opens its dropdown on hover and keeps the dropdown visible while the pointer is either over the corresponding header item (trigger area) or anywhere inside that dropdown panel (including when the panel is rendered via a portal). The dropdown must close only when the pointer is fully outside both the trigger area and the dropdown panel area, with smooth behavior and no flicker.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In the header navigation, when I hover over a menu item, its dropdown menu should appear.",
          "The dropdown menu should remain visible as long as the mouse pointer is either on the main header menu item or anywhere inside its dropdown menu.",
          "The dropdown should disappear only when the mouse pointer moves completely outside both the respective header item and its dropdown area.",
          "The behavior should be smooth and should not flicker. It should work on hover (not click)."
        ]
      },
      "acceptanceCriteria": [
        "On desktop, hovering a header menu item that has children opens its dropdown without requiring a click.",
        "Moving the pointer from the header item into its dropdown panel does not close the dropdown (no flicker).",
        "The dropdown remains open while the pointer is anywhere inside the dropdown panel, including scrollable areas.",
        "The dropdown closes when (and only when) the pointer is outside both the header item area and the dropdown panel area."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure only one desktop header dropdown can be open at a time: when the pointer enters a different top-level header item, the previously open dropdown closes and the newly hovered item’s dropdown opens immediately and reliably (no timeouts or delayed close behavior that causes unstable transitions).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "If I move the mouse to another header menu item, the previous dropdown should automatically close, and the new dropdown should appear."
        ]
      },
      "acceptanceCriteria": [
        "When a dropdown is open and the user hovers another header item, the old dropdown closes and the new dropdown opens immediately.",
        "Rapid pointer movement across multiple header items does not leave multiple dropdowns open and does not cause flicker or “stuck open” states.",
        "Dropdown open/close behavior is hover-driven only (no click required to open)."
      ]
    }
  ],
  "constraints": [
    "Do not require click interactions for desktop dropdown open/close; behavior must be hover-driven.",
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only and must be composed, not modified).",
    "Keep the backend unchanged; this request is purely a frontend interaction change."
  ],
  "nonGoals": [
    "Changing mobile navigation behavior (Sheet-based mobile menu) beyond any necessary regression fixes.",
    "Adding new navigation items or changing navigation IA/content.",
    "Adding backend state or persistence for menu behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}