{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Scroll-synced Solutions landing sections and header dropdown state",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render /solutions as 6 distinct, scrollable category sections with anchored IDs and per-category service link grids sourced from solutionServices.",
      "acceptanceCriteria": [
        "Visiting /solutions shows 6 distinct category sections matching the existing 6 solution categories in the navigation.",
        "Each category section includes a link-list (or equivalent grid) of the services for that category, using the existing solutionServices registry as the source of truth.",
        "Each category section has a stable DOM anchor/id so it can be observed/highlighted while scrolling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SolutionsLandingPage.tsx",
          "operation": "create",
          "description": "Create a dedicated /solutions landing page that renders 6 clearly separated sections (one per existing navigation solution category). Each section must have a stable DOM id (use the category pageId) and render a grid/list of links for that category using the existing solutionServices registry (e.g., getServicesForCategory) as the source of truth. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/router/router.tsx",
          "operation": "modify",
          "description": "Wire /solutions route to render the new SolutionsLandingPage instead of the generic ContentPage so the landing page uses the required 6 anchored sections while preserving existing service page routes/URLs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add scroll-sync state so the SiteHeader 'Our Solutions' dropdown highlights the active category and shows that category’s services while scrolling on /solutions only.",
      "acceptanceCriteria": [
        "On /solutions, as the user scrolls through the 6 category sections, the header 'Our Solutions' dropdown visibly reflects the currently active category (e.g., highlighted category item).",
        "On /solutions, the dropdown also shows the service links for the currently active category (using the same routes already defined for service pages).",
        "On pages other than /solutions, the 'Our Solutions' dropdown remains in its normal/default state (no scroll-sync required).",
        "The implementation does not require any backend changes and does not break existing navigation links/routes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/solutions/solutionsScrollSyncContext.tsx",
          "operation": "create",
          "description": "Create a small React context/provider to store the active solution category pageId for scroll-sync on /solutions, plus helper hooks for reading/updating it. Ensure it can be reset when leaving /solutions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "modify",
          "description": "Wrap the app layout with the Solutions scroll-sync provider so both the /solutions page and SiteHeader can share active-category state. Include logic (based on current route) to clear/disable the active category state when not on /solutions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SolutionsLandingPage.tsx",
          "operation": "modify",
          "description": "Implement IntersectionObserver-based scroll tracking across the 6 category section anchors to update the shared active-category state as sections enter the viewport (choose stable activation thresholds/root margins to avoid flicker). Only run this logic on /solutions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update the 'Our Solutions' dropdown behavior: when on /solutions and an active category is present from scroll-sync state, visually highlight the active category item and render the service links for that active category (sourced from the same solutionServices registry/routes). When not on /solutions (or no active category), keep the dropdown in its current/default state and do not apply scroll-sync. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}