{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Header dropdown hover behavior: immediate close, portal-safe hover region, no flicker",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement reliable hover-based open/close for header dropdowns using combined hover-region detection across trigger and portal-rendered panel, preventing flicker and enabling auto-switch on hover.",
      "acceptanceCriteria": [
        "Hovering a top-level header item that has children opens its dropdown without requiring a click.",
        "When the pointer leaves the combined hover region (trigger + dropdown panel), the dropdown closes immediately (no intentional delay).",
        "Moving the pointer from the trigger to the dropdown panel does not cause the dropdown to close or flicker.",
        "Moving the pointer from one top-level header item to another automatically closes the previously open dropdown and opens the newly hovered item’s dropdown.",
        "The behavior applies consistently to the \"Our Solutions\" mega menu dropdown and other dropdowns (e.g., About Us, Industries We Serve)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDropdownHoverRegion.ts",
          "operation": "create",
          "description": "Add a reusable hook to manage a dropdown's open state using robust pointer-based hover-region detection across separate DOM subtrees (trigger + portal panel). The hook should expose refs/setters for the trigger and panel elements and close immediately when the pointer is outside both. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Update desktop header dropdown interactions to be hover-driven (no click required) while remaining stable with portal-rendered content. Use the new hover-region hook to coordinate trigger + DropdownMenuContent hover state (including the SolutionsMegaMenu panel) so moving between trigger and panel does not flicker, and leaving both closes immediately. Ensure hovering a different top-level item switches the open dropdown. Use the existing shadcn-ui DropdownMenu/DropdownMenuContent components (portal behavior) and verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove timeout-based closing logic and enforce a single-open-dropdown state with stable transitions during rapid pointer movement.",
      "acceptanceCriteria": [
        "The header dropdown system does not rely on a close delay to prevent flicker; instead, it uses robust hover-region detection so closing is immediate when outside both trigger and panel.",
        "Rapidly moving the pointer across multiple top-level items does not leave multiple dropdowns open, and does not cause visible flashing/flicker of the dropdown panel.",
        "No regressions to navigation link routing: clicking dropdown items still navigates to the correct route."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Remove the timeout-based close behavior and any related refs/state. Ensure the header maintains a single authoritative openDropdownId and that state transitions are deterministic during rapid hover changes (e.g., immediately switch openDropdownId on new trigger hover; close only when pointer is outside both the active trigger and active portal panel). Maintain existing Link routing for dropdown items. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useDropdownHoverRegion.ts",
          "operation": "modify",
          "description": "Refine the hover-region hook behavior to support rapid transitions: if the active dropdown changes, update tracked trigger/panel elements immediately and avoid transient close/reopen flashing. Keep close behavior immediate when outside both regions. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}